---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LockedTopOffset
source: html/2b90a94d-ddb9-0d74-bcfa-01211bfe7da8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LockedTopOffset Property

"Positive Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId LockedTopOffset { get; }
```